MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
extern volatile T3CONBITS T3CONbits __attribute__((__sfr__));

#define TMR4 TMR4
extern volatile uint16_t TMR4 __attribute__((__sfr__));
#define TMR5HLD TMR5HLD
extern volatile uint16_t TMR5HLD __attribute__((__sfr__));
#define TMR5 TMR5
extern volatile uint16_t TMR5 __attribute__((__sfr__));
#define PR4 PR4
extern volatile uint16_t PR4 __attribute__((__sfr__));
#define PR5 PR5
extern volatile uint16_t PR5 __attribute__((__sfr__));
#define T4CON T4CON
extern volatile uint16_t T4CON __attribute__((__sfr__));
__extension__ typedef struct tagT4CONBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t TCS:1;
      uint16_t :1;
      uint16_t T32:1;
      uint16_t TCKPS:2;
      uint16_t TGATE:1;
      uint16_t :1;
      uint16_t TECS:2;
      uint16_t :3;
      uint16_t TSIDL:1;
      uint16_t :1;
      uint16_t TON:1;
    };
    struct {
      uint16_t :4;
      uint16_t TCKPS0:1;
      uint16_t TCKPS1:1;
      uint16_t :2;
      uint16_t TECS0:1;
      uint16_t TECS1:1;
    };
    struct {
      uint16_t :8;
      uint16_t TIECS:2;
    };
    struct {
      uint16_t :8;
      uint16_t TIECS0:1;
      uint16_t TIECS1:1;
    };
    struct {
      uint16_t :3;
      uint16_t T45:1;
    };
  };
} T4CONBITS;
extern volatile T4CONBITS T4CONbits __attribute__((__sfr__));

#define T5CON T5CON
extern volatile uint16_t T5CON __attribute__((__sfr__));
__extension__ typedef struct tagT5CONBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t TCS:1;
      uint16_t :2;
      uint16_t TCKPS:2;
      uint16_t TGATE:1;
      uint16_t :1;
      uint16_t TECS:2;
      uint16_t :3;
      uint16_t TSIDL:1;
      uint16_t :1;
      uint16_t TON:1;
    };
    struct {
      uint16_t :4;
      uint16_t TCKPS0:1;
      uint16_t TCKPS1:1;
      uint16_t :2;
      uint16_t TECS0:1;
      uint16_t TECS1:1;
    };
    struct {
      uint16_t :8;
      uint16_t TIECS:2;
    };
    struct {
      uint16_t :8;
      uint16_t TIECS0:1;
      uint16_t TIECS1:1;
    };
  };
} T5CONBITS;
extern volatile T5CONBITS T5CONbits __attribute__((__sfr__));

#define CTMUCON1L CTMUCON1L
extern volatile uint16_t CTMUCON1L __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON1LBITS {
  union {
    struct {
      uint16_t IRNG:2;
      uint16_t ITRIM:6;
      uint16_t CTTRIG:1;
      uint16_t IDISSEN:1;
      uint16_t EDGSEQEN:1;
      uint16_t EDGEN:1;
      uint16_t TGEN:1;
      uint16_t CTMUSIDL:1;
      uint16_t :1;
      uint16_t CTMUEN:1;
    };
    struct {
      uint16_t IRNG0:1;
      uint16_t IRNG1:1;
      uint16_t ITRIM0:1;
      uint16_t ITRIM1:1;
      uint16_t ITRIM2:1;
      uint16_t ITRIM3:1;
      uint16_t ITRIM4:1;
      uint16_t ITRIM5:1;
    };
  };
} CTMUCON1LBITS;
extern volatile CTMUCON1LBITS CTMUCON1Lbits __attribute__((__sfr__));

#define CTMUCON1H CTMUCON1H
extern volatile uint16_t CTMUCON1H __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON1HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t EDG2SEL:4;
      uint16_t EDG2POL:1;
      uint16_t EDG2MOD:1;
      uint16_t EDG1STAT:1;
      uint16_t EDG2STAT:1;
      uint16_t EDG1SEL:4;
      uint16_t EDG1POL:1;
      uint16_t EDG1MOD:1;
    };
    struct {
      uint16_t :2;
      uint16_t EDG2SEL0:1;
      uint16_t EDG2SEL1:1;
      uint16_t EDG2SEL2:1;
      uint16_t EDG2SEL3:1;
      uint16_t :4;
      uint16_t EDG1SEL0:1;
      uint16_t EDG1SEL1:1;
      uint16_t EDG1SEL2:1;
      uint16_t EDG1SEL3:1;
    };
  };
} CTMUCON1HBITS;
extern volatile CTMUCON1HBITS CTMUCON1Hbits __attribute__((__sfr__));

#define CTMUCON2 CTMUCON2
extern volatile uint16_t CTMUCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON2BITS {
  union {
    struct {
      uint16_t DISCHS:3;
      uint16_t :1;
      uint16_t IRSTEN:1;
    };
    struct {
      uint16_t DISCHS0:1;
      uint16_t DISCHS1:1;
      uint16_t DISCHS2:1;
    };
  };
} CTMUCON2BITS;
extern volatile CTMUCON2BITS CTMUCON2bits __attribute__((__sfr__));

#define CTMUCON2L CTMUCON2L
extern volatile uint16_t CTMUCON2L __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON2LBITS {
  union {
    struct {
      uint16_t DISCHS:3;
      uint16_t :1;
      uint16_t IRSTEN:1;
    };
    struct {
      uint16_t DISCHS0:1;
      uint16_t DISCHS1:1;
      uint16_t DISCHS2:1;
    };
  };
} CTMUCON2LBITS;
extern volatile CTMUCON2LBITS CTMUCON2Lbits __attribute__((__sfr__));

#define CTMUCON2H CTMUCON2H
extern volatile uint16_t CTMUCON2H __attribute__((__sfr__));
#define RTCCON1L RTCCON1L
extern volatile uint16_t RTCCON1L __attribute__((__sfr__));
typedef struct tagRTCCON1LBITS {
  uint16_t TSAEN:1;
  uint16_t TSBEN:1;
  uint16_t :2;
  uint16_t OUTSEL:3;
  uint16_t RTCOE:1;
  uint16_t PWCPOE:1;
  uint16_t PWCPOL:1;
  uint16_t PWCEN:1;
  uint16_t WRLOCK:1;
  uint16_t :3;
  uint16_t RTCEN:1;
} RTCCON1LBITS;
extern volatile RTCCON1LBITS RTCCON1Lbits __attribute__((__sfr__));

#define RTCCON1H RTCCON1H
extern volatile uint16_t RTCCON1H __attribute__((__sfr__));
typedef struct tagRTCCON1HBITS {
  uint16_t ALMRPT:8;
  uint16_t AMASK:4;
  uint16_t :2;
  uint16_t CHIME:1;
  uint16_t ALRMEN:1;
} RTCCON1HBITS;
extern volatile RTCCON1HBITS RTCCON1Hbits __attribute__((__sfr__));

#define RTCCON2L RTCCON2L
extern volatile uint16_t RTCCON2L __attribute__((__sfr__));
typedef struct tagRTCCON2LBITS {
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t PS:2;
  uint16_t PWCPS:2;
  uint16_t :3;
  uint16_t FDIV:5;
} RTCCON2LBITS;
extern volatile RTCCON2LBITS RTCCON2Lbits __attribute__((__sfr__));

#define RTCCON2H RTCCON2H
extern volatile uint16_t RTCCON2H __attribute__((__sfr__));
#define RTCCON3L RTCCON3L
extern volatile uint16_t RTCCON3L __attribute__((__sfr__));
typedef struct tagRTCCON3LBITS {
  uint16_t PWCSTAB:8;
  uint16_t PWCSAMP:8;
} RTCCON3LBITS;
extern volatile RTCCON3LBITS RTCCON3Lbits __attribute__((__sfr__));

#define RTCCON3H RTCCON3H
extern volatile uint16_t RTCCON3H __attribute__((__sfr__));
#define RTCSTATL RTCSTATL
extern volatile uint16_t RTCSTATL __attribute__((__sfr__));
typedef struct tagRTCSTATLBITS {
  uint16_t HALFSEC:1;
  uint16_t ALMSYNC:1;
  uint16_t SYNC:1;
  uint16_t TSAEVT:1;
  uint16_t TSBEVT:1;
  uint16_t ALMEVT:1;
  uint16_t :1;
  uint16_t CPLCK:1;
} RTCSTATLBITS;
extern volatile RTCSTATLBITS RTCSTATLbits __attribute__((__sfr__));

#define RTCSTATH RTCSTATH
extern volatile uint16_t RTCSTATH __attribute__((__sfr__));
#define TIMEL TIMEL
extern volatile uint16_t TIMEL __attribute__((__sfr__));
typedef struct tagTIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} TIMELBITS;
extern volatile TIMELBITS TIMELbits __attribute__((__sfr__));

#define TIMEH TIMEH
extern volatile uint16_t TIMEH __attribute__((__sfr__));
typedef struct tagTIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} TIMEHBITS;
