MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
extern volatile IOCNDBITS IOCNDbits __attribute__((__sfr__));

#define IOCFD IOCFD
extern volatile uint16_t IOCFD __attribute__((__sfr__));
typedef struct tagIOCFDBITS {
  uint16_t IOCFD0:1;
  uint16_t IOCFD1:1;
  uint16_t IOCFD2:1;
  uint16_t IOCFD3:1;
  uint16_t IOCFD4:1;
  uint16_t IOCFD5:1;
  uint16_t IOCFD6:1;
  uint16_t IOCFD7:1;
  uint16_t IOCFD8:1;
  uint16_t IOCFD9:1;
  uint16_t IOCFD10:1;
  uint16_t IOCFD11:1;
} IOCFDBITS;
extern volatile IOCFDBITS IOCFDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t CNPUD __attribute__((__sfr__));
__extension__ typedef struct tagCNPUDBITS {
  union {
    struct {
      uint16_t IOCPD0:1;
      uint16_t IOCPD1:1;
      uint16_t IOCPD2:1;
      uint16_t IOCPD3:1;
      uint16_t IOCPD4:1;
      uint16_t IOCPD5:1;
      uint16_t IOCPD6:1;
      uint16_t IOCPD7:1;
      uint16_t IOCPD8:1;
      uint16_t IOCPD9:1;
      uint16_t IOCPD10:1;
      uint16_t IOCPD11:1;
    };
    struct {
      uint16_t IOCPUD0:1;
      uint16_t IOCPUD1:1;
      uint16_t IOCPUD2:1;
      uint16_t IOCPUD3:1;
      uint16_t IOCPUD4:1;
      uint16_t IOCPUD5:1;
      uint16_t IOCPUD6:1;
      uint16_t IOCPUD7:1;
      uint16_t IOCPUD8:1;
      uint16_t IOCPUD9:1;
      uint16_t IOCPUD10:1;
      uint16_t IOCPUD11:1;
    };
    struct {
      uint16_t CNPUD0:1;
      uint16_t CNPUD1:1;
      uint16_t CNPUD2:1;
      uint16_t CNPUD3:1;
      uint16_t CNPUD4:1;
      uint16_t CNPUD5:1;
      uint16_t CNPUD6:1;
      uint16_t CNPUD7:1;
      uint16_t CNPUD8:1;
      uint16_t CNPUD9:1;
      uint16_t CNPUD10:1;
      uint16_t CNPUD11:1;
    };
  };
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define IOCPUD IOCPUD
extern volatile uint16_t IOCPUD __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUDBITS {
  union {
    struct {
      uint16_t IOCPD0:1;
      uint16_t IOCPD1:1;
      uint16_t IOCPD2:1;
      uint16_t IOCPD3:1;
      uint16_t IOCPD4:1;
      uint16_t IOCPD5:1;
      uint16_t IOCPD6:1;
      uint16_t IOCPD7:1;
      uint16_t IOCPD8:1;
      uint16_t IOCPD9:1;
      uint16_t IOCPD10:1;
      uint16_t IOCPD11:1;
    };
    struct {
      uint16_t IOCPUD0:1;
      uint16_t IOCPUD1:1;
      uint16_t IOCPUD2:1;
      uint16_t IOCPUD3:1;
      uint16_t IOCPUD4:1;
      uint16_t IOCPUD5:1;
      uint16_t IOCPUD6:1;
      uint16_t IOCPUD7:1;
      uint16_t IOCPUD8:1;
      uint16_t IOCPUD9:1;
      uint16_t IOCPUD10:1;
      uint16_t IOCPUD11:1;
    };
    struct {
      uint16_t CNPUD0:1;
      uint16_t CNPUD1:1;
      uint16_t CNPUD2:1;
      uint16_t CNPUD3:1;
      uint16_t CNPUD4:1;
      uint16_t CNPUD5:1;
      uint16_t CNPUD6:1;
      uint16_t CNPUD7:1;
      uint16_t CNPUD8:1;
      uint16_t CNPUD9:1;
      uint16_t CNPUD10:1;
      uint16_t CNPUD11:1;
    };
  };
} IOCPUDBITS;
extern volatile IOCPUDBITS IOCPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t CNPDD __attribute__((__sfr__));
__extension__ typedef struct tagCNPDDBITS {
  union {
    struct {
      uint16_t IOCPDD0:1;
      uint16_t IOCPDD1:1;
      uint16_t IOCPDD2:1;
      uint16_t IOCPDD3:1;
      uint16_t IOCPDD4:1;
      uint16_t IOCPDD5:1;
      uint16_t IOCPDD6:1;
      uint16_t IOCPDD7:1;
      uint16_t IOCPDD8:1;
      uint16_t IOCPDD9:1;
      uint16_t IOCPDD10:1;
      uint16_t IOCPDD11:1;
    };
    struct {
      uint16_t CNPDD0:1;
      uint16_t CNPDD1:1;
      uint16_t CNPDD2:1;
      uint16_t CNPDD3:1;
      uint16_t CNPDD4:1;
      uint16_t CNPDD5:1;
      uint16_t CNPDD6:1;
      uint16_t CNPDD7:1;
      uint16_t CNPDD8:1;
      uint16_t CNPDD9:1;
      uint16_t CNPDD10:1;
      uint16_t CNPDD11:1;
    };
  };
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define IOCPDD IOCPDD
extern volatile uint16_t IOCPDD __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDDBITS {
  union {
    struct {
      uint16_t IOCPDD0:1;
      uint16_t IOCPDD1:1;
      uint16_t IOCPDD2:1;
      uint16_t IOCPDD3:1;
      uint16_t IOCPDD4:1;
      uint16_t IOCPDD5:1;
      uint16_t IOCPDD6:1;
      uint16_t IOCPDD7:1;
      uint16_t IOCPDD8:1;
      uint16_t IOCPDD9:1;
      uint16_t IOCPDD10:1;
      uint16_t IOCPDD11:1;
    };
    struct {
      uint16_t CNPDD0:1;
      uint16_t CNPDD1:1;
      uint16_t CNPDD2:1;
      uint16_t CNPDD3:1;
      uint16_t CNPDD4:1;
      uint16_t CNPDD5:1;
      uint16_t CNPDD6:1;
      uint16_t CNPDD7:1;
      uint16_t CNPDD8:1;
      uint16_t CNPDD9:1;
      uint16_t CNPDD10:1;
      uint16_t CNPDD11:1;
    };
  };
} IOCPDDBITS;
extern volatile IOCPDDBITS IOCPDDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile uint16_t TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  uint16_t TRISE0:1;
  uint16_t TRISE1:1;
  uint16_t TRISE2:1;
  uint16_t TRISE3:1;
  uint16_t TRISE4:1;
  uint16_t TRISE5:1;
  uint16_t TRISE6:1;
  uint16_t TRISE7:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile uint16_t PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  uint16_t RE0:1;
  uint16_t RE1:1;
  uint16_t RE2:1;
  uint16_t RE3:1;
  uint16_t RE4:1;
  uint16_t RE5:1;
  uint16_t RE6:1;
  uint16_t RE7:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t LATE2:1;
  uint16_t LATE3:1;
  uint16_t LATE4:1;
  uint16_t LATE5:1;
  uint16_t LATE6:1;
  uint16_t LATE7:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile uint16_t ODCE __attribute__((__sfr__));
typedef struct tagODCEBITS {
  uint16_t ODCE0:1;
  uint16_t ODCE1:1;
  uint16_t ODCE2:1;
  uint16_t ODCE3:1;
  uint16_t ODCE4:1;
  uint16_t ODCE5:1;
  uint16_t ODCE6:1;
  uint16_t ODCE7:1;
} ODCEBITS;
extern volatile ODCEBITS ODCEbits __attribute__((__sfr__));

#define ANSE ANSE
extern volatile uint16_t ANSE __attribute__((__sfr__));
__extension__ typedef struct tagANSEBITS {
  union {
    struct {
      uint16_t ANSE0:1;
      uint16_t ANSE1:1;
      uint16_t ANSE2:1;
      uint16_t ANSE3:1;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
    };
    struct {
      uint16_t ANSELE0:1;
      uint16_t ANSELE1:1;
      uint16_t ANSELE2:1;
      uint16_t ANSELE3:1;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
    };
  };
} ANSEBITS;
extern volatile ANSEBITS ANSEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
__extension__ typedef struct tagANSELEBITS {
  union {
    struct {
      uint16_t ANSE0:1;
      uint16_t ANSE1:1;
      uint16_t ANSE2:1;
      uint16_t ANSE3:1;
      uint16_t ANSE4:1;
      uint16_t ANSE5:1;
      uint16_t ANSE6:1;
      uint16_t ANSE7:1;
    };
    struct {
      uint16_t ANSELE0:1;
      uint16_t ANSELE1:1;
      uint16_t ANSELE2:1;
      uint16_t ANSELE3:1;
      uint16_t ANSELE4:1;
      uint16_t ANSELE5:1;
      uint16_t ANSELE6:1;
      uint16_t ANSELE7:1;
    };
  };
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define IOCPE IOCPE
extern volatile uint16_t IOCPE __attribute__((__sfr__));
typedef struct tagIOCPEBITS {
  uint16_t IOCPE0:1;
  uint16_t IOCPE1:1;
  uint16_t IOCPE2:1;
  uint16_t IOCPE3:1;
  uint16_t IOCPE4:1;
  uint16_t IOCPE5:1;
  uint16_t IOCPE6:1;
  uint16_t IOCPE7:1;
} IOCPEBITS;
extern volatile IOCPEBITS IOCPEbits __attribute__((__sfr__));

#define IOCNE IOCNE
extern volatile uint16_t IOCNE __attribute__((__sfr__));
typedef struct tagIOCNEBITS {
  uint16_t IOCNE0:1;
  uint16_t IOCNE1:1;
  uint16_t IOCNE2:1;
  uint16_t IOCNE3:1;
  uint16_t IOCNE4:1;
  uint16_t IOCNE5:1;
  uint16_t IOCNE6:1;
  uint16_t IOCNE7:1;
} IOCNEBITS;
