MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
/* LCDDATA20 */
#define _S00C5 LCDDATA20bits.S00C5
#define _S01C5 LCDDATA20bits.S01C5
#define _S02C5 LCDDATA20bits.S02C5
#define _S03C5 LCDDATA20bits.S03C5
#define _S04C5 LCDDATA20bits.S04C5
#define _S05C5 LCDDATA20bits.S05C5
#define _S06C5 LCDDATA20bits.S06C5
#define _S07C5 LCDDATA20bits.S07C5
#define _S08C5 LCDDATA20bits.S08C5
#define _S09C5 LCDDATA20bits.S09C5
#define _S10C5 LCDDATA20bits.S10C5
#define _S11C5 LCDDATA20bits.S11C5
#define _S12C5 LCDDATA20bits.S12C5
#define _S13C5 LCDDATA20bits.S13C5
#define _S14C5 LCDDATA20bits.S14C5
#define _S15C5 LCDDATA20bits.S15C5

/* LCDDATA21 */
#define _S16C5 LCDDATA21bits.S16C5
#define _S17C5 LCDDATA21bits.S17C5
#define _S18C5 LCDDATA21bits.S18C5
#define _S19C5 LCDDATA21bits.S19C5
#define _S20C5 LCDDATA21bits.S20C5
#define _S21C5 LCDDATA21bits.S21C5
#define _S22C5 LCDDATA21bits.S22C5
#define _S23C5 LCDDATA21bits.S23C5
#define _S24C5 LCDDATA21bits.S24C5
#define _S25C5 LCDDATA21bits.S25C5
#define _S26C5 LCDDATA21bits.S26C5
#define _S27C5 LCDDATA21bits.S27C5
#define _S28C5 LCDDATA21bits.S28C5
#define _S29C5 LCDDATA21bits.S29C5
#define _S30C5 LCDDATA21bits.S30C5
#define _S31C5 LCDDATA21bits.S31C5

/* LCDDATA22 */
#define _S32C5 LCDDATA22bits.S32C5
#define _S33C5 LCDDATA22bits.S33C5
#define _S34C5 LCDDATA22bits.S34C5
#define _S35C5 LCDDATA22bits.S35C5
#define _S36C5 LCDDATA22bits.S36C5
#define _S37C5 LCDDATA22bits.S37C5
#define _S38C5 LCDDATA22bits.S38C5
#define _S39C5 LCDDATA22bits.S39C5
#define _S40C5 LCDDATA22bits.S40C5
#define _S41C5 LCDDATA22bits.S41C5
#define _S42C5 LCDDATA22bits.S42C5
#define _S43C5 LCDDATA22bits.S43C5
#define _S44C5 LCDDATA22bits.S44C5
#define _S45C5 LCDDATA22bits.S45C5
#define _S46C5 LCDDATA22bits.S46C5
#define _S47C5 LCDDATA22bits.S47C5

/* LCDDATA23 */
#define _S48C5 LCDDATA23bits.S48C5
#define _S49C5 LCDDATA23bits.S49C5
#define _S50C5 LCDDATA23bits.S50C5
#define _S51C5 LCDDATA23bits.S51C5
#define _S52C5 LCDDATA23bits.S52C5
#define _S53C5 LCDDATA23bits.S53C5
#define _S54C5 LCDDATA23bits.S54C5
#define _S55C5 LCDDATA23bits.S55C5
#define _S56C5 LCDDATA23bits.S56C5
#define _S57C5 LCDDATA23bits.S57C5
#define _S58C5 LCDDATA23bits.S58C5
#define _S59C5 LCDDATA23bits.S59C5
#define _S60C5 LCDDATA23bits.S60C5
#define _S61C5 LCDDATA23bits.S61C5
#define _S62C5 LCDDATA23bits.S62C5
#define _S63C5 LCDDATA23bits.S63C5

/* LCDDATA24 */
#define _S00C6 LCDDATA24bits.S00C6
#define _S01C6 LCDDATA24bits.S01C6
#define _S02C6 LCDDATA24bits.S02C6
#define _S03C6 LCDDATA24bits.S03C6
#define _S04C6 LCDDATA24bits.S04C6
#define _S05C6 LCDDATA24bits.S05C6
#define _S06C6 LCDDATA24bits.S06C6
#define _S07C6 LCDDATA24bits.S07C6
#define _S08C6 LCDDATA24bits.S08C6
#define _S09C6 LCDDATA24bits.S09C6
#define _S10C6 LCDDATA24bits.S10C6
#define _S11C6 LCDDATA24bits.S11C6
#define _S12C6 LCDDATA24bits.S12C6
#define _S13C6 LCDDATA24bits.S13C6
#define _S14C6 LCDDATA24bits.S14C6
#define _S15C6 LCDDATA24bits.S15C6

/* LCDDATA25 */
#define _S16C6 LCDDATA25bits.S16C6
#define _S17C6 LCDDATA25bits.S17C6
#define _S18C6 LCDDATA25bits.S18C6
#define _S19C6 LCDDATA25bits.S19C6
#define _S20C6 LCDDATA25bits.S20C6
#define _S21C6 LCDDATA25bits.S21C6
#define _S22C6 LCDDATA25bits.S22C6
#define _S23C6 LCDDATA25bits.S23C6
#define _S24C6 LCDDATA25bits.S24C6
#define _S25C6 LCDDATA25bits.S25C6
#define _S26C6 LCDDATA25bits.S26C6
#define _S27C6 LCDDATA25bits.S27C6
#define _S28C6 LCDDATA25bits.S28C6
#define _S29C6 LCDDATA25bits.S29C6
#define _S30C6 LCDDATA25bits.S30C6
#define _S31C6 LCDDATA25bits.S31C6

/* LCDDATA26 */
#define _S32C6 LCDDATA26bits.S32C6
#define _S33C6 LCDDATA26bits.S33C6
#define _S34C6 LCDDATA26bits.S34C6
#define _S35C6 LCDDATA26bits.S35C6
#define _S36C6 LCDDATA26bits.S36C6
#define _S37C6 LCDDATA26bits.S37C6
#define _S38C6 LCDDATA26bits.S38C6
#define _S39C6 LCDDATA26bits.S39C6
#define _S40C6 LCDDATA26bits.S40C6
#define _S41C6 LCDDATA26bits.S41C6
#define _S42C6 LCDDATA26bits.S42C6
#define _S43C6 LCDDATA26bits.S43C6
#define _S44C6 LCDDATA26bits.S44C6
#define _S45C6 LCDDATA26bits.S45C6
#define _S46C6 LCDDATA26bits.S46C6
#define _S47C6 LCDDATA26bits.S47C6

/* LCDDATA27 */
#define _S48C6 LCDDATA27bits.S48C6
#define _S49C6 LCDDATA27bits.S49C6
#define _S50C6 LCDDATA27bits.S50C6
#define _S51C6 LCDDATA27bits.S51C6
#define _S52C6 LCDDATA27bits.S52C6
#define _S53C6 LCDDATA27bits.S53C6
#define _S54C6 LCDDATA27bits.S54C6
#define _S55C6 LCDDATA27bits.S55C6
#define _S56C6 LCDDATA27bits.S56C6
#define _S57C6 LCDDATA27bits.S57C6
#define _S58C6 LCDDATA27bits.S58C6
#define _S59C6 LCDDATA27bits.S59C6
#define _S60C6 LCDDATA27bits.S60C6
#define _S61C6 LCDDATA27bits.S61C6
#define _S62C6 LCDDATA27bits.S62C6
#define _S63C6 LCDDATA27bits.S63C6

/* LCDDATA28 */
#define _S00C7 LCDDATA28bits.S00C7
#define _S01C7 LCDDATA28bits.S01C7
#define _S02C7 LCDDATA28bits.S02C7
#define _S03C7 LCDDATA28bits.S03C7
#define _S04C7 LCDDATA28bits.S04C7
#define _S05C7 LCDDATA28bits.S05C7
#define _S06C7 LCDDATA28bits.S06C7
#define _S07C7 LCDDATA28bits.S07C7
#define _S08C7 LCDDATA28bits.S08C7
#define _S09C7 LCDDATA28bits.S09C7
#define _S10C7 LCDDATA28bits.S10C7
#define _S11C7 LCDDATA28bits.S11C7
#define _S12C7 LCDDATA28bits.S12C7
#define _S13C7 LCDDATA28bits.S13C7
#define _S14C7 LCDDATA28bits.S14C7
#define _S15C7 LCDDATA28bits.S15C7

/* LCDDATA29 */
#define _S16C7 LCDDATA29bits.S16C7
#define _S17C7 LCDDATA29bits.S17C7
#define _S18C7 LCDDATA29bits.S18C7
#define _S19C7 LCDDATA29bits.S19C7
#define _S20C7 LCDDATA29bits.S20C7
#define _S21C7 LCDDATA29bits.S21C7
#define _S22C7 LCDDATA29bits.S22C7
#define _S23C7 LCDDATA29bits.S23C7
#define _S24C7 LCDDATA29bits.S24C7
#define _S25C7 LCDDATA29bits.S25C7
#define _S26C7 LCDDATA29bits.S26C7
#define _S27C7 LCDDATA29bits.S27C7
#define _S28C7 LCDDATA29bits.S28C7
#define _S29C7 LCDDATA29bits.S29C7
#define _S30C7 LCDDATA29bits.S30C7
#define _S31C7 LCDDATA29bits.S31C7

/* LCDDATA30 */
#define _S32C7 LCDDATA30bits.S32C7
#define _S33C7 LCDDATA30bits.S33C7
#define _S34C7 LCDDATA30bits.S34C7
#define _S35C7 LCDDATA30bits.S35C7
#define _S36C7 LCDDATA30bits.S36C7
#define _S37C7 LCDDATA30bits.S37C7
#define _S38C7 LCDDATA30bits.S38C7
#define _S39C7 LCDDATA30bits.S39C7
#define _S40C7 LCDDATA30bits.S40C7
#define _S41C7 LCDDATA30bits.S41C7
#define _S42C7 LCDDATA30bits.S42C7
#define _S43C7 LCDDATA30bits.S43C7
#define _S44C7 LCDDATA30bits.S44C7
#define _S45C7 LCDDATA30bits.S45C7
#define _S46C7 LCDDATA30bits.S46C7
#define _S47C7 LCDDATA30bits.S47C7

/* LCDDATA31 */
#define _S48C7 LCDDATA31bits.S48C7
#define _S49C7 LCDDATA31bits.S49C7
#define _S50C7 LCDDATA31bits.S50C7
#define _S51C7 LCDDATA31bits.S51C7
#define _S52C7 LCDDATA31bits.S52C7
#define _S53C7 LCDDATA31bits.S53C7
#define _S54C7 LCDDATA31bits.S54C7
#define _S55C7 LCDDATA31bits.S55C7
#define _S56C7 LCDDATA31bits.S56C7
#define _S57C7 LCDDATA31bits.S57C7
#define _S58C7 LCDDATA31bits.S58C7
#define _S59C7 LCDDATA31bits.S59C7
#define _S60C7 LCDDATA31bits.S60C7
#define _S61C7 LCDDATA31bits.S61C7
#define _S62C7 LCDDATA31bits.S62C7
#define _S63C7 LCDDATA31bits.S63C7

/* LCDSE0 */
#define _SE00 LCDSE0bits.SE00
#define _SE01 LCDSE0bits.SE01
#define _SE02 LCDSE0bits.SE02
#define _SE03 LCDSE0bits.SE03
#define _SE04 LCDSE0bits.SE04
#define _SE05 LCDSE0bits.SE05
#define _SE06 LCDSE0bits.SE06
#define _SE07 LCDSE0bits.SE07
#define _SE08 LCDSE0bits.SE08
#define _SE09 LCDSE0bits.SE09
#define _SE10 LCDSE0bits.SE10
#define _SE11 LCDSE0bits.SE11
#define _SE12 LCDSE0bits.SE12
#define _SE13 LCDSE0bits.SE13
#define _SE14 LCDSE0bits.SE14
#define _SE15 LCDSE0bits.SE15

/* LCDSE1 */
#define _SE16 LCDSE1bits.SE16
#define _SE17 LCDSE1bits.SE17
#define _SE18 LCDSE1bits.SE18
#define _SE19 LCDSE1bits.SE19
#define _SE20 LCDSE1bits.SE20
#define _SE21 LCDSE1bits.SE21
#define _SE22 LCDSE1bits.SE22
#define _SE23 LCDSE1bits.SE23
#define _SE24 LCDSE1bits.SE24
#define _SE25 LCDSE1bits.SE25
#define _SE26 LCDSE1bits.SE26
#define _SE27 LCDSE1bits.SE27
#define _SE28 LCDSE1bits.SE28
#define _SE29 LCDSE1bits.SE29
#define _SE30 LCDSE1bits.SE30
#define _SE31 LCDSE1bits.SE31

/* LCDSE2 */
#define _SE32 LCDSE2bits.SE32
#define _SE33 LCDSE2bits.SE33
#define _SE34 LCDSE2bits.SE34
#define _SE35 LCDSE2bits.SE35
#define _SE36 LCDSE2bits.SE36
#define _SE37 LCDSE2bits.SE37
#define _SE38 LCDSE2bits.SE38
#define _SE39 LCDSE2bits.SE39
#define _SE40 LCDSE2bits.SE40
#define _SE41 LCDSE2bits.SE41
#define _SE42 LCDSE2bits.SE42
#define _SE43 LCDSE2bits.SE43
#define _SE44 LCDSE2bits.SE44
#define _SE45 LCDSE2bits.SE45
#define _SE46 LCDSE2bits.SE46
#define _SE47 LCDSE2bits.SE47

