MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
/* IOCPF */
/* Bitname _IOCPF0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF13 cannot be defined because it is used by more than one SFR */

/* IOCNF */
#define _IOCNF0 IOCNFbits.IOCNF0
#define _IOCNF1 IOCNFbits.IOCNF1
#define _IOCNF2 IOCNFbits.IOCNF2
#define _IOCNF3 IOCNFbits.IOCNF3
#define _IOCNF4 IOCNFbits.IOCNF4
#define _IOCNF5 IOCNFbits.IOCNF5
#define _IOCNF6 IOCNFbits.IOCNF6
#define _IOCNF7 IOCNFbits.IOCNF7
#define _IOCNF8 IOCNFbits.IOCNF8
#define _IOCNF12 IOCNFbits.IOCNF12
#define _IOCNF13 IOCNFbits.IOCNF13

/* IOCFF */
#define _IOCFF0 IOCFFbits.IOCFF0
#define _IOCFF1 IOCFFbits.IOCFF1
#define _IOCFF2 IOCFFbits.IOCFF2
#define _IOCFF3 IOCFFbits.IOCFF3
#define _IOCFF4 IOCFFbits.IOCFF4
#define _IOCFF5 IOCFFbits.IOCFF5
#define _IOCFF6 IOCFFbits.IOCFF6
#define _IOCFF7 IOCFFbits.IOCFF7
#define _IOCFF8 IOCFFbits.IOCFF8
#define _IOCFF12 IOCFFbits.IOCFF12
#define _IOCFF13 IOCFFbits.IOCFF13

/* CNPUF */
/* Bitname _IOCPF0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF13 cannot be defined because it is used by more than one SFR */
#define _IOCPUF0 CNPUFbits.IOCPUF0
#define _IOCPUF1 CNPUFbits.IOCPUF1
#define _IOCPUF2 CNPUFbits.IOCPUF2
#define _IOCPUF3 CNPUFbits.IOCPUF3
#define _IOCPUF4 CNPUFbits.IOCPUF4
#define _IOCPUF5 CNPUFbits.IOCPUF5
#define _IOCPUF6 CNPUFbits.IOCPUF6
#define _IOCPUF7 CNPUFbits.IOCPUF7
#define _IOCPUF8 CNPUFbits.IOCPUF8
#define _IOCPUF12 CNPUFbits.IOCPUF12
#define _IOCPUF13 CNPUFbits.IOCPUF13
#define _CNPUF0 CNPUFbits.CNPUF0
#define _CNPUF1 CNPUFbits.CNPUF1
#define _CNPUF2 CNPUFbits.CNPUF2
#define _CNPUF3 CNPUFbits.CNPUF3
#define _CNPUF4 CNPUFbits.CNPUF4
#define _CNPUF5 CNPUFbits.CNPUF5
#define _CNPUF6 CNPUFbits.CNPUF6
#define _CNPUF7 CNPUFbits.CNPUF7
#define _CNPUF8 CNPUFbits.CNPUF8
#define _CNPUF12 CNPUFbits.CNPUF12
#define _CNPUF13 CNPUFbits.CNPUF13

/* CNPDF */
#define _IOCPDF0 CNPDFbits.IOCPDF0
#define _IOCPDF1 CNPDFbits.IOCPDF1
#define _IOCPDF2 CNPDFbits.IOCPDF2
#define _IOCPDF3 CNPDFbits.IOCPDF3
#define _IOCPDF4 CNPDFbits.IOCPDF4
#define _IOCPDF5 CNPDFbits.IOCPDF5
#define _IOCPDF6 CNPDFbits.IOCPDF6
#define _IOCPDF7 CNPDFbits.IOCPDF7
#define _IOCPDF8 CNPDFbits.IOCPDF8
#define _IOCPDF12 CNPDFbits.IOCPDF12
#define _IOCPDF13 CNPDFbits.IOCPDF13
#define _CNPDF0 CNPDFbits.CNPDF0
#define _CNPDF1 CNPDFbits.CNPDF1
#define _CNPDF2 CNPDFbits.CNPDF2
#define _CNPDF3 CNPDFbits.CNPDF3
#define _CNPDF4 CNPDFbits.CNPDF4
#define _CNPDF5 CNPDFbits.CNPDF5
#define _CNPDF6 CNPDFbits.CNPDF6
#define _CNPDF7 CNPDFbits.CNPDF7
#define _CNPDF8 CNPDFbits.CNPDF8
#define _CNPDF12 CNPDFbits.CNPDF12
#define _CNPDF13 CNPDFbits.CNPDF13

/* TRISG */
#define _TRISG0 TRISGbits.TRISG0
#define _TRISG1 TRISGbits.TRISG1
#define _TRISG2 TRISGbits.TRISG2
#define _TRISG3 TRISGbits.TRISG3
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9
#define _TRISG12 TRISGbits.TRISG12
#define _TRISG13 TRISGbits.TRISG13
#define _TRISG14 TRISGbits.TRISG14
#define _TRISG15 TRISGbits.TRISG15

/* PORTG */
#define _RG0 PORTGbits.RG0
#define _RG1 PORTGbits.RG1
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9
#define _RG12 PORTGbits.RG12
#define _RG13 PORTGbits.RG13
#define _RG14 PORTGbits.RG14
#define _RG15 PORTGbits.RG15

/* LATG */
#define _LATG0 LATGbits.LATG0
#define _LATG1 LATGbits.LATG1
#define _LATG2 LATGbits.LATG2
#define _LATG3 LATGbits.LATG3
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9
#define _LATG12 LATGbits.LATG12
#define _LATG13 LATGbits.LATG13
#define _LATG14 LATGbits.LATG14
#define _LATG15 LATGbits.LATG15

/* ODCG */
#define _ODCG0 ODCGbits.ODCG0
#define _ODCG1 ODCGbits.ODCG1
#define _ODCG2 ODCGbits.ODCG2
#define _ODCG3 ODCGbits.ODCG3
#define _ODCG6 ODCGbits.ODCG6
#define _ODCG7 ODCGbits.ODCG7
#define _ODCG8 ODCGbits.ODCG8
#define _ODCG9 ODCGbits.ODCG9
#define _ODCG12 ODCGbits.ODCG12
#define _ODCG13 ODCGbits.ODCG13
#define _ODCG14 ODCGbits.ODCG14
#define _ODCG15 ODCGbits.ODCG15

/* ANSELG */
#define _ANSG0 ANSELGbits.ANSG0
#define _ANSG1 ANSELGbits.ANSG1
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9
#define _ANSG12 ANSELGbits.ANSG12
#define _ANSG13 ANSELGbits.ANSG13
#define _ANSG14 ANSELGbits.ANSG14
#define _ANSG15 ANSELGbits.ANSG15
#define _ANSELG0 ANSELGbits.ANSELG0
#define _ANSELG1 ANSELGbits.ANSELG1
#define _ANSELG6 ANSELGbits.ANSELG6
#define _ANSELG7 ANSELGbits.ANSELG7
#define _ANSELG8 ANSELGbits.ANSELG8
#define _ANSELG9 ANSELGbits.ANSELG9
#define _ANSELG12 ANSELGbits.ANSELG12
#define _ANSELG13 ANSELGbits.ANSELG13
#define _ANSELG14 ANSELGbits.ANSELG14
#define _ANSELG15 ANSELGbits.ANSELG15

/* IOCPG */
/* Bitname _IOCPG0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG15 cannot be defined because it is used by more than one SFR */

/* IOCNG */
#define _IOCNG0 IOCNGbits.IOCNG0
#define _IOCNG1 IOCNGbits.IOCNG1
#define _IOCNG2 IOCNGbits.IOCNG2
#define _IOCNG3 IOCNGbits.IOCNG3
#define _IOCNG6 IOCNGbits.IOCNG6
#define _IOCNG7 IOCNGbits.IOCNG7
#define _IOCNG8 IOCNGbits.IOCNG8
#define _IOCNG9 IOCNGbits.IOCNG9
#define _IOCNG12 IOCNGbits.IOCNG12
#define _IOCNG13 IOCNGbits.IOCNG13
#define _IOCNG14 IOCNGbits.IOCNG14
#define _IOCNG15 IOCNGbits.IOCNG15

/* IOCFG */
#define _IOCFG0 IOCFGbits.IOCFG0
#define _IOCFG1 IOCFGbits.IOCFG1
#define _IOCFG2 IOCFGbits.IOCFG2
#define _IOCFG3 IOCFGbits.IOCFG3
#define _IOCFG6 IOCFGbits.IOCFG6
#define _IOCFG7 IOCFGbits.IOCFG7
#define _IOCFG8 IOCFGbits.IOCFG8
#define _IOCFG9 IOCFGbits.IOCFG9
#define _IOCFG12 IOCFGbits.IOCFG12
#define _IOCFG13 IOCFGbits.IOCFG13
#define _IOCFG14 IOCFGbits.IOCFG14
#define _IOCFG15 IOCFGbits.IOCFG15

