MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
#define _ALMDATEH_MTHONE_POSITION                0x00000000
#define _ALMDATEH_MTHONE_MASK                    0x0000000F
#define _ALMDATEH_MTHONE_LENGTH                  0x00000004

#define _ALMDATEH_MTHTEN_POSITION                0x00000004
#define _ALMDATEH_MTHTEN_MASK                    0x00000010
#define _ALMDATEH_MTHTEN_LENGTH                  0x00000001

#define _ALMDATEH_YRONE_POSITION                 0x00000008
#define _ALMDATEH_YRONE_MASK                     0x00000F00
#define _ALMDATEH_YRONE_LENGTH                   0x00000004

#define _ALMDATEH_YRTEN_POSITION                 0x0000000C
#define _ALMDATEH_YRTEN_MASK                     0x0000F000
#define _ALMDATEH_YRTEN_LENGTH                   0x00000004

#define _TSATIMEL_SECONE_POSITION                0x00000008
#define _TSATIMEL_SECONE_MASK                    0x00000F00
#define _TSATIMEL_SECONE_LENGTH                  0x00000004

#define _TSATIMEL_SECTEN_POSITION                0x0000000C
#define _TSATIMEL_SECTEN_MASK                    0x00007000
#define _TSATIMEL_SECTEN_LENGTH                  0x00000003

#define _TSATIMEH_MINONE_POSITION                0x00000000
#define _TSATIMEH_MINONE_MASK                    0x0000000F
#define _TSATIMEH_MINONE_LENGTH                  0x00000004

#define _TSATIMEH_MINTEN_POSITION                0x00000004
#define _TSATIMEH_MINTEN_MASK                    0x00000070
#define _TSATIMEH_MINTEN_LENGTH                  0x00000003

#define _TSATIMEH_HRONE_POSITION                 0x00000008
#define _TSATIMEH_HRONE_MASK                     0x00000F00
#define _TSATIMEH_HRONE_LENGTH                   0x00000004

#define _TSATIMEH_HRTEN_POSITION                 0x0000000C
#define _TSATIMEH_HRTEN_MASK                     0x00003000
#define _TSATIMEH_HRTEN_LENGTH                   0x00000002

#define _TSADATEL_WDAY_POSITION                  0x00000000
#define _TSADATEL_WDAY_MASK                      0x00000007
#define _TSADATEL_WDAY_LENGTH                    0x00000003

#define _TSADATEL_DAYONE_POSITION                0x00000008
#define _TSADATEL_DAYONE_MASK                    0x00000F00
#define _TSADATEL_DAYONE_LENGTH                  0x00000004

#define _TSADATEL_DAYTEN_POSITION                0x0000000C
#define _TSADATEL_DAYTEN_MASK                    0x00003000
#define _TSADATEL_DAYTEN_LENGTH                  0x00000002

#define _TSADATEH_MTHONE_POSITION                0x00000000
#define _TSADATEH_MTHONE_MASK                    0x0000000F
#define _TSADATEH_MTHONE_LENGTH                  0x00000004

#define _TSADATEH_MTHTEN_POSITION                0x00000004
#define _TSADATEH_MTHTEN_MASK                    0x00000010
#define _TSADATEH_MTHTEN_LENGTH                  0x00000001

#define _TSADATEH_YRONE_POSITION                 0x00000008
#define _TSADATEH_YRONE_MASK                     0x00000F00
#define _TSADATEH_YRONE_LENGTH                   0x00000004

#define _TSADATEH_YRTEN_POSITION                 0x0000000C
#define _TSADATEH_YRTEN_MASK                     0x0000F000
#define _TSADATEH_YRTEN_LENGTH                   0x00000004

#define _TSBTIMEL_SECONE_POSITION                0x00000008
#define _TSBTIMEL_SECONE_MASK                    0x00000F00
#define _TSBTIMEL_SECONE_LENGTH                  0x00000004

#define _TSBTIMEL_SECTEN_POSITION                0x0000000C
#define _TSBTIMEL_SECTEN_MASK                    0x00007000
#define _TSBTIMEL_SECTEN_LENGTH                  0x00000003

#define _TSBTIMEH_MINONE_POSITION                0x00000000
#define _TSBTIMEH_MINONE_MASK                    0x0000000F
#define _TSBTIMEH_MINONE_LENGTH                  0x00000004

#define _TSBTIMEH_MINTEN_POSITION                0x00000004
#define _TSBTIMEH_MINTEN_MASK                    0x00000070
#define _TSBTIMEH_MINTEN_LENGTH                  0x00000003

#define _TSBTIMEH_HRONE_POSITION                 0x00000008
#define _TSBTIMEH_HRONE_MASK                     0x00000F00
#define _TSBTIMEH_HRONE_LENGTH                   0x00000004

#define _TSBTIMEH_HRTEN_POSITION                 0x0000000C
#define _TSBTIMEH_HRTEN_MASK                     0x00003000
#define _TSBTIMEH_HRTEN_LENGTH                   0x00000002

#define _TSBDATEL_WDAY_POSITION                  0x00000000
#define _TSBDATEL_WDAY_MASK                      0x00000007
#define _TSBDATEL_WDAY_LENGTH                    0x00000003

#define _TSBDATEL_DAYONE_POSITION                0x00000008
#define _TSBDATEL_DAYONE_MASK                    0x00000F00
#define _TSBDATEL_DAYONE_LENGTH                  0x00000004

#define _TSBDATEL_DAYTEN_POSITION                0x0000000C
#define _TSBDATEL_DAYTEN_MASK                    0x00003000
#define _TSBDATEL_DAYTEN_LENGTH                  0x00000002

#define _TSBDATEH_MTHONE_POSITION                0x00000000
#define _TSBDATEH_MTHONE_MASK                    0x0000000F
#define _TSBDATEH_MTHONE_LENGTH                  0x00000004

#define _TSBDATEH_MTHTEN_POSITION                0x00000004
#define _TSBDATEH_MTHTEN_MASK                    0x00000010
#define _TSBDATEH_MTHTEN_LENGTH                  0x00000001

#define _TSBDATEH_YRONE_POSITION                 0x00000008
#define _TSBDATEH_YRONE_MASK                     0x00000F00
#define _TSBDATEH_YRONE_LENGTH                   0x00000004

#define _TSBDATEH_YRTEN_POSITION                 0x0000000C
#define _TSBDATEH_YRTEN_MASK                     0x0000F000
#define _TSBDATEH_YRTEN_LENGTH                   0x00000004

#define _IC1CON1_ICM_POSITION                    0x00000000
#define _IC1CON1_ICM_MASK                        0x00000007
#define _IC1CON1_ICM_LENGTH                      0x00000003

#define _IC1CON1_ICBNE_POSITION                  0x00000003
#define _IC1CON1_ICBNE_MASK                      0x00000008
#define _IC1CON1_ICBNE_LENGTH                    0x00000001

#define _IC1CON1_ICOV_POSITION                   0x00000004
#define _IC1CON1_ICOV_MASK                       0x00000010
#define _IC1CON1_ICOV_LENGTH                     0x00000001

#define _IC1CON1_ICI_POSITION                    0x00000005
#define _IC1CON1_ICI_MASK                        0x00000060
#define _IC1CON1_ICI_LENGTH                      0x00000002

#define _IC1CON1_ICTSEL_POSITION                 0x0000000A
#define _IC1CON1_ICTSEL_MASK                     0x00001C00
#define _IC1CON1_ICTSEL_LENGTH                   0x00000003

#define _IC1CON1_ICSIDL_POSITION                 0x0000000D
#define _IC1CON1_ICSIDL_MASK                     0x00002000
#define _IC1CON1_ICSIDL_LENGTH                   0x00000001

