MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
#define _ANCFG_VBGEN_POSITION                    0x00000000
#define _ANCFG_VBGEN_MASK                        0x00000001
#define _ANCFG_VBGEN_LENGTH                      0x00000001

#define _ANCFG_VBG2EN_POSITION                   0x00000001
#define _ANCFG_VBG2EN_MASK                       0x00000002
#define _ANCFG_VBG2EN_LENGTH                     0x00000001

#define _ANCFG_VBG3EN_POSITION                   0x00000002
#define _ANCFG_VBG3EN_MASK                       0x00000004
#define _ANCFG_VBG3EN_LENGTH                     0x00000001

#define _ANCFG_VBG4EN_POSITION                   0x00000003
#define _ANCFG_VBG4EN_MASK                       0x00000008
#define _ANCFG_VBG4EN_LENGTH                     0x00000001

#define _ANCFG_VBG5EN_POSITION                   0x00000004
#define _ANCFG_VBG5EN_MASK                       0x00000010
#define _ANCFG_VBG5EN_LENGTH                     0x00000001

#define _ANCFG_VBG6EN_POSITION                   0x00000005
#define _ANCFG_VBG6EN_MASK                       0x00000020
#define _ANCFG_VBG6EN_LENGTH                     0x00000001

#define _DAC1CON_DACREF_POSITION                 0x00000000
#define _DAC1CON_DACREF_MASK                     0x00000003
#define _DAC1CON_DACREF_LENGTH                   0x00000002

#define _DAC1CON_DACTSEL_POSITION                0x00000002
#define _DAC1CON_DACTSEL_MASK                    0x0000007C
#define _DAC1CON_DACTSEL_LENGTH                  0x00000005

#define _DAC1CON_DACOE_POSITION                  0x00000007
#define _DAC1CON_DACOE_MASK                      0x00000080
#define _DAC1CON_DACOE_LENGTH                    0x00000001

#define _DAC1CON_DACTRIG_POSITION                0x00000008
#define _DAC1CON_DACTRIG_MASK                    0x00000100
#define _DAC1CON_DACTRIG_LENGTH                  0x00000001

#define _DAC1CON_DACFM_POSITION                  0x0000000B
#define _DAC1CON_DACFM_MASK                      0x00000800
#define _DAC1CON_DACFM_LENGTH                    0x00000001

#define _DAC1CON_DACSLP_POSITION                 0x0000000C
#define _DAC1CON_DACSLP_MASK                     0x00001000
#define _DAC1CON_DACSLP_LENGTH                   0x00000001

#define _DAC1CON_DACSIDL_POSITION                0x0000000D
#define _DAC1CON_DACSIDL_MASK                    0x00002000
#define _DAC1CON_DACSIDL_LENGTH                  0x00000001

#define _DAC1CON_DACEN_POSITION                  0x0000000F
#define _DAC1CON_DACEN_MASK                      0x00008000
#define _DAC1CON_DACEN_LENGTH                    0x00000001

#define _CCP4CON1L_MOD_POSITION                  0x00000000
#define _CCP4CON1L_MOD_MASK                      0x0000000F
#define _CCP4CON1L_MOD_LENGTH                    0x00000004

#define _CCP4CON1L_CCSEL_POSITION                0x00000004
#define _CCP4CON1L_CCSEL_MASK                    0x00000010
#define _CCP4CON1L_CCSEL_LENGTH                  0x00000001

#define _CCP4CON1L_T32_POSITION                  0x00000005
#define _CCP4CON1L_T32_MASK                      0x00000020
#define _CCP4CON1L_T32_LENGTH                    0x00000001

#define _CCP4CON1L_TMRPS_POSITION                0x00000006
#define _CCP4CON1L_TMRPS_MASK                    0x000000C0
#define _CCP4CON1L_TMRPS_LENGTH                  0x00000002

#define _CCP4CON1L_CLKSEL_POSITION               0x00000008
#define _CCP4CON1L_CLKSEL_MASK                   0x00000700
#define _CCP4CON1L_CLKSEL_LENGTH                 0x00000003

#define _CCP4CON1L_TMRSYNC_POSITION              0x0000000B
#define _CCP4CON1L_TMRSYNC_MASK                  0x00000800
#define _CCP4CON1L_TMRSYNC_LENGTH                0x00000001

#define _CCP4CON1L_CCPSLP_POSITION               0x0000000C
#define _CCP4CON1L_CCPSLP_MASK                   0x00001000
#define _CCP4CON1L_CCPSLP_LENGTH                 0x00000001

#define _CCP4CON1L_CCPSIDL_POSITION              0x0000000D
#define _CCP4CON1L_CCPSIDL_MASK                  0x00002000
#define _CCP4CON1L_CCPSIDL_LENGTH                0x00000001

#define _CCP4CON1L_CCPON_POSITION                0x0000000F
#define _CCP4CON1L_CCPON_MASK                    0x00008000
#define _CCP4CON1L_CCPON_LENGTH                  0x00000001

#define _CCP4CON1L_MOD0_POSITION                 0x00000000
#define _CCP4CON1L_MOD0_MASK                     0x00000001
#define _CCP4CON1L_MOD0_LENGTH                   0x00000001

#define _CCP4CON1L_MOD1_POSITION                 0x00000001
#define _CCP4CON1L_MOD1_MASK                     0x00000002
#define _CCP4CON1L_MOD1_LENGTH                   0x00000001

#define _CCP4CON1L_MOD2_POSITION                 0x00000002
#define _CCP4CON1L_MOD2_MASK                     0x00000004
#define _CCP4CON1L_MOD2_LENGTH                   0x00000001

#define _CCP4CON1L_MOD3_POSITION                 0x00000003
#define _CCP4CON1L_MOD3_MASK                     0x00000008
#define _CCP4CON1L_MOD3_LENGTH                   0x00000001

#define _CCP4CON1L_TMR32_POSITION                0x00000005
#define _CCP4CON1L_TMR32_MASK                    0x00000020
#define _CCP4CON1L_TMR32_LENGTH                  0x00000001

#define _CCP4CON1L_TMRPS0_POSITION               0x00000006
#define _CCP4CON1L_TMRPS0_MASK                   0x00000040
#define _CCP4CON1L_TMRPS0_LENGTH                 0x00000001

#define _CCP4CON1L_TMRPS1_POSITION               0x00000007
#define _CCP4CON1L_TMRPS1_MASK                   0x00000080
#define _CCP4CON1L_TMRPS1_LENGTH                 0x00000001

#define _CCP4CON1L_CLKSEL0_POSITION              0x00000008
#define _CCP4CON1L_CLKSEL0_MASK                  0x00000100
#define _CCP4CON1L_CLKSEL0_LENGTH                0x00000001

#define _CCP4CON1L_CLKSEL1_POSITION              0x00000009
#define _CCP4CON1L_CLKSEL1_MASK                  0x00000200
#define _CCP4CON1L_CLKSEL1_LENGTH                0x00000001

#define _CCP4CON1L_CLKSEL2_POSITION              0x0000000A
#define _CCP4CON1L_CLKSEL2_MASK                  0x00000400
#define _CCP4CON1L_CLKSEL2_LENGTH                0x00000001

#define _CCP4CON1L_CCPMOD_POSITION               0x00000000
#define _CCP4CON1L_CCPMOD_MASK                   0x0000000F
#define _CCP4CON1L_CCPMOD_LENGTH                 0x00000004

#define _CCP4CON1L_CCPMOD0_POSITION              0x00000000
#define _CCP4CON1L_CCPMOD0_MASK                  0x00000001
#define _CCP4CON1L_CCPMOD0_LENGTH                0x00000001

#define _CCP4CON1L_CCPMOD1_POSITION              0x00000001
#define _CCP4CON1L_CCPMOD1_MASK                  0x00000002
#define _CCP4CON1L_CCPMOD1_LENGTH                0x00000001

#define _CCP4CON1L_CCPMOD2_POSITION              0x00000002
#define _CCP4CON1L_CCPMOD2_MASK                  0x00000004
#define _CCP4CON1L_CCPMOD2_LENGTH                0x00000001

#define _CCP4CON1L_CCPMOD3_POSITION              0x00000003
#define _CCP4CON1L_CCPMOD3_MASK                  0x00000008
#define _CCP4CON1L_CCPMOD3_LENGTH                0x00000001

#define _CCP4CON1H_SYNC_POSITION                 0x00000000
#define _CCP4CON1H_SYNC_MASK                     0x0000001F
#define _CCP4CON1H_SYNC_LENGTH                   0x00000005

