MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA406/mcu.h
#define _ANSELD_ANSELD6_POSITION                 0x00000006
#define _ANSELD_ANSELD6_MASK                     0x00000040
#define _ANSELD_ANSELD6_LENGTH                   0x00000001

#define _ANSELD_ANSELD7_POSITION                 0x00000007
#define _ANSELD_ANSELD7_MASK                     0x00000080
#define _ANSELD_ANSELD7_LENGTH                   0x00000001

#define _ANSELD_ANSELD8_POSITION                 0x00000008
#define _ANSELD_ANSELD8_MASK                     0x00000100
#define _ANSELD_ANSELD8_LENGTH                   0x00000001

#define _ANSELD_ANSELD9_POSITION                 0x00000009
#define _ANSELD_ANSELD9_MASK                     0x00000200
#define _ANSELD_ANSELD9_LENGTH                   0x00000001

#define _ANSELD_ANSELD10_POSITION                0x0000000A
#define _ANSELD_ANSELD10_MASK                    0x00000400
#define _ANSELD_ANSELD10_LENGTH                  0x00000001

#define _ANSELD_ANSELD11_POSITION                0x0000000B
#define _ANSELD_ANSELD11_MASK                    0x00000800
#define _ANSELD_ANSELD11_LENGTH                  0x00000001

#define _IOCPD_IOCPD0_POSITION                   0x00000000
#define _IOCPD_IOCPD0_MASK                       0x00000001
#define _IOCPD_IOCPD0_LENGTH                     0x00000001

#define _IOCPD_IOCPD1_POSITION                   0x00000001
#define _IOCPD_IOCPD1_MASK                       0x00000002
#define _IOCPD_IOCPD1_LENGTH                     0x00000001

#define _IOCPD_IOCPD2_POSITION                   0x00000002
#define _IOCPD_IOCPD2_MASK                       0x00000004
#define _IOCPD_IOCPD2_LENGTH                     0x00000001

#define _IOCPD_IOCPD3_POSITION                   0x00000003
#define _IOCPD_IOCPD3_MASK                       0x00000008
#define _IOCPD_IOCPD3_LENGTH                     0x00000001

#define _IOCPD_IOCPD4_POSITION                   0x00000004
#define _IOCPD_IOCPD4_MASK                       0x00000010
#define _IOCPD_IOCPD4_LENGTH                     0x00000001

#define _IOCPD_IOCPD5_POSITION                   0x00000005
#define _IOCPD_IOCPD5_MASK                       0x00000020
#define _IOCPD_IOCPD5_LENGTH                     0x00000001

#define _IOCPD_IOCPD6_POSITION                   0x00000006
#define _IOCPD_IOCPD6_MASK                       0x00000040
#define _IOCPD_IOCPD6_LENGTH                     0x00000001

#define _IOCPD_IOCPD7_POSITION                   0x00000007
#define _IOCPD_IOCPD7_MASK                       0x00000080
#define _IOCPD_IOCPD7_LENGTH                     0x00000001

#define _IOCPD_IOCPD8_POSITION                   0x00000008
#define _IOCPD_IOCPD8_MASK                       0x00000100
#define _IOCPD_IOCPD8_LENGTH                     0x00000001

#define _IOCPD_IOCPD9_POSITION                   0x00000009
#define _IOCPD_IOCPD9_MASK                       0x00000200
#define _IOCPD_IOCPD9_LENGTH                     0x00000001

#define _IOCPD_IOCPD10_POSITION                  0x0000000A
#define _IOCPD_IOCPD10_MASK                      0x00000400
#define _IOCPD_IOCPD10_LENGTH                    0x00000001

#define _IOCPD_IOCPD11_POSITION                  0x0000000B
#define _IOCPD_IOCPD11_MASK                      0x00000800
#define _IOCPD_IOCPD11_LENGTH                    0x00000001

#define _IOCND_IOCND0_POSITION                   0x00000000
#define _IOCND_IOCND0_MASK                       0x00000001
#define _IOCND_IOCND0_LENGTH                     0x00000001

#define _IOCND_IOCND1_POSITION                   0x00000001
#define _IOCND_IOCND1_MASK                       0x00000002
#define _IOCND_IOCND1_LENGTH                     0x00000001

#define _IOCND_IOCND2_POSITION                   0x00000002
#define _IOCND_IOCND2_MASK                       0x00000004
#define _IOCND_IOCND2_LENGTH                     0x00000001

#define _IOCND_IOCND3_POSITION                   0x00000003
#define _IOCND_IOCND3_MASK                       0x00000008
#define _IOCND_IOCND3_LENGTH                     0x00000001

#define _IOCND_IOCND4_POSITION                   0x00000004
#define _IOCND_IOCND4_MASK                       0x00000010
#define _IOCND_IOCND4_LENGTH                     0x00000001

#define _IOCND_IOCND5_POSITION                   0x00000005
#define _IOCND_IOCND5_MASK                       0x00000020
#define _IOCND_IOCND5_LENGTH                     0x00000001

#define _IOCND_IOCND6_POSITION                   0x00000006
#define _IOCND_IOCND6_MASK                       0x00000040
#define _IOCND_IOCND6_LENGTH                     0x00000001

#define _IOCND_IOCND7_POSITION                   0x00000007
#define _IOCND_IOCND7_MASK                       0x00000080
#define _IOCND_IOCND7_LENGTH                     0x00000001

#define _IOCND_IOCND8_POSITION                   0x00000008
#define _IOCND_IOCND8_MASK                       0x00000100
#define _IOCND_IOCND8_LENGTH                     0x00000001

#define _IOCND_IOCND9_POSITION                   0x00000009
#define _IOCND_IOCND9_MASK                       0x00000200
#define _IOCND_IOCND9_LENGTH                     0x00000001

#define _IOCND_IOCND10_POSITION                  0x0000000A
#define _IOCND_IOCND10_MASK                      0x00000400
#define _IOCND_IOCND10_LENGTH                    0x00000001

#define _IOCND_IOCND11_POSITION                  0x0000000B
#define _IOCND_IOCND11_MASK                      0x00000800
#define _IOCND_IOCND11_LENGTH                    0x00000001

#define _IOCFD_IOCFD0_POSITION                   0x00000000
#define _IOCFD_IOCFD0_MASK                       0x00000001
#define _IOCFD_IOCFD0_LENGTH                     0x00000001

#define _IOCFD_IOCFD1_POSITION                   0x00000001
#define _IOCFD_IOCFD1_MASK                       0x00000002
#define _IOCFD_IOCFD1_LENGTH                     0x00000001

#define _IOCFD_IOCFD2_POSITION                   0x00000002
#define _IOCFD_IOCFD2_MASK                       0x00000004
#define _IOCFD_IOCFD2_LENGTH                     0x00000001

#define _IOCFD_IOCFD3_POSITION                   0x00000003
#define _IOCFD_IOCFD3_MASK                       0x00000008
#define _IOCFD_IOCFD3_LENGTH                     0x00000001

#define _IOCFD_IOCFD4_POSITION                   0x00000004
#define _IOCFD_IOCFD4_MASK                       0x00000010
#define _IOCFD_IOCFD4_LENGTH                     0x00000001

